Министерство науки и высшего образования Российской Федерации Федеральное государственное бюджетное образовательное учреждение высшего образования Уфимский университет науки и технологий
Кафедра АСУ
Отчет по лабораторной работе №3 по дисциплине «Основы современных цифровых технологий и искусственного интеллекта» на тему «Диаграмма как код»
Выполнила: студентка группы ИВТ-ИСУ-102Б Мусина Аделина Руслановна
г. Уфа, 2024
Задание 1
Алгори́тм (лат. algorithmi — от имени среднеазиатского математика Аль-Хорезми[1]) — совокупность точно заданных правил решения некоторого класса задач или набор инструкций, описывающих порядок действий исполнителя для решения определённой задачи.
Само слово «алгоритм» происходит от имени персидского (хорезмского и мавераннахрского) учёного аль-Хорезми. Около 825 года он написал сочинение Китаб аль-джебр валь-мукабала («Книга о сложении и вычитании»), из оригинального названия которого происходит слово «алгебра» (аль-джебр — восполнение). В этой книге впервые дал описание придуманной в Индии позиционной десятичной системы счисления. Персидский оригинал книги не сохранился. Аль-Хорезми сформулировал правила вычислений в новой системе и, вероятно, впервые использовал цифру 0 для обозначения пропущенной позиции в записи числа (её индийское название арабы перевели как as-sifr или просто sifr, отсюда такие слова, как «цифра» и «шифр»). Приблизительно в это же время индийские цифры начали применять и другие арабские учёные.

В первой половине XII века книга аль-Хорезми в латинском переводе проникла в Европу. Переводчик, имя которого до нас не дошло, дал ей название Algoritmi de numero Indorum («Алгоритмы о счёте индийском») — таким образом, латинизированное имя среднеазиатского учёного было вынесено в заглавие книги. Сегодня считается, что слово «алгоритм» попало в европейские языки именно благодаря этому переводу. В течение нескольких следующих столетий появилось множество других трудов, посвящённых всё тому же вопросу — обучению искусству счёта с помощью цифр, и все они имели в названии слово algoritmi или algorismi.

Задание 2
Блок-схема — распространённый тип схем (графических моделей), описывающих алгоритмы или процессы, в которых отдельные шаги изображаются в виде блоков различной формы, соединённых между собой линиями, указывающими направление последовательности.

Задание 3
Термин "блок-схема алгоритма" был впервые использован в середине XX века, когда появились первые компьютеры и необходимость визуализировать процесс обработки данных. Это произошло примерно в 1940-х годах. С тех пор блок-схемы стали стандартом представления алгоритмов и программного кода, помогающим разработчикам лучше понимать логику работы программы.

Со временем термин "блок-схема алгоритма" стал общепринятым и устоявшимся в профессиональной среде программистов. Однако со временем стало ясно, что слово "блок-схема" может вводить в заблуждение, так как многие люди воспринимают его как нечто физическое, а не абстрактное. Поэтому в некоторых контекстах стали использовать более общее название "схема алгоритма".

Задание 4
ГОСТ-19.701-90 (ИСО 5807-85). СХЕМЫ АЛГОРИТМОВ, ПРОГРАММ, ДАННЫХ И СИСТЕМ

Задание 5
Workflow Diagram — это визуальное представление бизнес-процесса, которое показывает последовательность шагов и задачи, необходимые для выполнения определенной работы. Эти диаграммы помогают упростить и структурировать сложные операции, делая их более понятными для участников процесса.
Связь с Flowchart
Workflow Diagram и Flowchart (схема алгоритма) имеют много общего, так как оба используют стандартизированные символы и формы для визуализации процессов. Однако между ними есть различия:
Цель: Workflow Diagram фокусируется на движении задач и информации между различными участниками или системами, в то время как Flowchart может использоваться для описания любых процессов, включая алгоритмы, с акцентом на последовательность шагов.
Символы: Оба типа диаграмм используют схожие символы (овал для начала и конца, прямоугольник для действий, ромб для решений), но контекст их применения может различаться.
Использование: Workflow Diagram часто применяется в бизнесе для оптимизации процессов и улучшения взаимодействия между отделами, тогда как Flowchart может быть использован в более широком контексте, включая программирование и математику6.
Таким образом, хотя Workflow Diagram и Flowchart имеют схожие элементы и цели визуализации процессов, они служат разным целям и могут применяться в различных контекстах.

Задание 6
https://viewer.diagrams.net/?tags=%7B%7D&lightbox=1&highlight=0000ff&edit=_blank&layers=1&nav=1&title=musina_adelina_lab3.svg#R%3Cmxfile%3E%3Cdiagram%20name%3D%22%D0%A1%D1%82%D1%80%D0%B0%D0%BD%D0%B8%D1%86%D0%B0%20%E2%80%94%201%22%20id%3D%22jZSvhWNHFJNzH1tC4M-Y%22%3E3ZVRT4MwEMc%2FDY8mUJBtr25MH9SXmZj41sBJMYUj5Rjgp7eMMkamE02mxifaX69c79%2F%2FpZa7TOtrxXNxhxFIi9lRbbkrizHHY77%2BtKTpyGzhdCBWSWSCBrBJXsFA29AyiaAYBRKipCQfwxCzDEIaMa4UVuOwZ5TjrDmP4QhsQi6P6WMSkejonM0GfgNJLPrMjr%2FoVlLeB5tKCsEjrA6QG1juUiFSN0rrJchWvF6Xbt%2F6g9X9wRRkNGUDifWa5nYdFPcP6VNO3iouL7zuL1suS1OwOSw1vQIQaUHMFBUJjDHjMhjolcIyi6BNY%2BvZEHOLmGvoaPgCRI25XV4SaiQolWa1y9km%2BrA2gwosVQgnCuo9wlUMdCKO7W9AWxcwBVKN3qdAckq243Nw46F4HzfIrAdG6S%2Bo7kxQXUpt8VbdSiQEm5zvyq50l72n3RYUQX1aveNqzQa2MDYwPco8Y9lqcLzT21gcuH1un0mgy%2F9mSzbRlu5v2pJ9rvpY05%2B3putPtKZ%2FLmu6f7t3vakCfaN39XR4rnZrB4%2B%2BG7wB%3C%2Fdiagram%3E%3C%2Fmxfile%3E

Задание 7
Слово "терминатор" (от англ. "terminator") происходит от латинского "terminare", что означает "заканчивать" или "ограничивать". В английском языке этот термин часто используется для обозначения чего-то, что завершает или уничтожает. В контексте научной фантастики и поп-культуры, термин "терминатор" стал символом кибернетических существ, которые обладают способностью уничтожать цели с высокой эффективностью.

Задание 8
